Autodesk.Revit.DB.Structure.LoadCombination.UsageName(System.Int32)
Returns usage value.
index: The index of usage in load combination.
Remarks: The index should be not less 0 and be less than load factors count.

Autodesk.Revit.DB.Structure.LoadCombination.NumberOfUsages
Returns number of usages.

Autodesk.Revit.DB.Structure.LoadCombination.CombinationNatureName(System.Int32)
Returns load combination nature name of load case element.
index: The index of load case.
Remarks: The index should be not less 0 and be less than load cases count.

Autodesk.Revit.DB.Structure.LoadCombination.CombinationCaseName(System.Int32)
Returns load combination case name.
index: The index of load case.
Remarks: The index should be not less then 0 and be less than load cases count.

Autodesk.Revit.DB.Structure.LoadCombination.Factor(System.Int32)
Returns factor value.
index: The index of factor in load combination.
Remarks: The index should be not less 0 and be less than load factors count.

Autodesk.Revit.DB.Structure.LoadCombination.NumberOfComponents
Returns number of factors.

Autodesk.Revit.DB.Structure.LoadCombination.CombinationState
Returns load combination state.
Remarks: The state should be "Serviceability" or "Ultimate".

Autodesk.Revit.DB.Structure.LoadCombination.CombinationType
Returns load combination type.
Remarks: The type should be "Combination" or "Envelope".

Autodesk.Revit.DB.Structure.LoadCombination.CombinationStateIndex
Returns the index in predefined load combination state array {}.
Remarks: The index should be 0 ("Serviceability") or 1 ("Ultimate").

Autodesk.Revit.DB.Structure.LoadCombination.CombinationTypeIndex
Returns the index in predefined load combination type array.
Remarks: The index should be 0 ("Combination") or 1 ("Envelope").

Autodesk.Revit.DB.Structure.LoadCombination.Name
Returns load combination name.

Autodesk.Revit.DB.Structure.LoadCombination
An object that represents a load combination.